<?php
/*
Template Name: main-landing
Template Post Type: post, page, product
*/
?>

<?php get_header(); ?>

</div>
</div>

<?= getPopularProducts() ?>

<section class="okna-process">
    <div class="container">
        <h2 class="okna-header okna-process__header">
            Процесс производства
        </h2>

        <div class="okna-process__container">
            <div class="okna-process__left">
                <div class="okna-process-card">
                    <p class="okna-process-card__title">
                        Тщательный анализ
                        <span>
                        <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M22.6042 20.4167H21.4521L21.0438 20.0229C22.4729 18.3604 23.3333 16.2021 23.3333 13.8542C23.3333 8.61875 19.0896 4.375 13.8542 4.375C8.61875 4.375 4.375 8.61875 4.375 13.8542C4.375 19.0896 8.61875 23.3333 13.8542 23.3333C16.2021 23.3333 18.3604 22.4729 20.0229 21.0438L20.4167 21.4521V22.6042L27.7083 29.8813L29.8813 27.7083L22.6042 20.4167V20.4167ZM13.8542 20.4167C10.2229 20.4167 7.29167 17.4854 7.29167 13.8542C7.29167 10.2229 10.2229 7.29167 13.8542 7.29167C17.4854 7.29167 20.4167 10.2229 20.4167 13.8542C20.4167 17.4854 17.4854 20.4167 13.8542 20.4167Z"
                                  fill="white"/>
                        </svg>
                    </span>
                    </p>
                    <p class="okna-process-card__text okna-text">
                        Оптимизация функций, выбор системы, цветовые решения, комплектность окон и дверей
                    </p>
                </div>
                <div class="okna-process-card">
                    <p class="okna-process-card__title">
                        Согласование
                        <span>
                       <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                  d="M17.5 32.8125C21.5611 32.8125 25.4559 31.1992 28.3276 28.3276C31.1992 25.4559 32.8125 21.5611 32.8125 17.5C32.8125 13.4389 31.1992 9.54408 28.3276 6.67243C25.4559 3.80078 21.5611 2.1875 17.5 2.1875C13.4389 2.1875 9.54408 3.80078 6.67243 6.67243C3.80078 9.54408 2.1875 13.4389 2.1875 17.5C2.1875 21.5611 3.80078 25.4559 6.67243 28.3276C9.54408 31.1992 13.4389 32.8125 17.5 32.8125V32.8125ZM17.5 35C22.1413 35 26.5925 33.1563 29.8744 29.8744C33.1563 26.5925 35 22.1413 35 17.5C35 12.8587 33.1563 8.40752 29.8744 5.12563C26.5925 1.84375 22.1413 0 17.5 0C12.8587 0 8.40752 1.84375 5.12563 5.12563C1.84375 8.40752 0 12.8587 0 17.5C0 22.1413 1.84375 26.5925 5.12563 29.8744C8.40752 33.1563 12.8587 35 17.5 35V35Z"
                                  fill="white"/>
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                  d="M23.9969 10.8719C24.303 10.5685 24.7163 10.3977 25.1473 10.3965C25.5784 10.3953 25.9926 10.5638 26.3004 10.8656C26.6082 11.1674 26.7849 11.5782 26.7923 12.0092C26.7996 12.4402 26.637 12.8567 26.3397 13.1688L17.6072 24.0844C17.4571 24.2461 17.276 24.3758 17.0746 24.4659C16.8732 24.5559 16.6558 24.6044 16.4352 24.6085C16.2147 24.6126 15.9956 24.5722 15.791 24.4896C15.5865 24.4071 15.4007 24.2842 15.2447 24.1282L9.45875 18.3401C9.29756 18.1899 9.16827 18.0087 9.0786 17.8075C8.98893 17.6062 8.94072 17.389 8.93683 17.1687C8.93294 16.9484 8.97347 16.7296 9.05598 16.5253C9.1385 16.321 9.26131 16.1355 9.4171 15.9797C9.57289 15.8239 9.75847 15.7011 9.96275 15.6185C10.167 15.536 10.3859 15.4955 10.6061 15.4994C10.8264 15.5033 11.0437 15.5515 11.2449 15.6412C11.4462 15.7308 11.6273 15.8601 11.7775 16.0213L16.3581 20.5998L23.9553 10.9201C23.9689 10.9031 23.9835 10.887 23.9991 10.8719H23.9969Z"
                                  fill="white"/>
                        </svg>
                    </span>
                    </p>
                    <p class="okna-process-card__text okna-text">
                        Утверждение заказчиком рабочих эскизов
                    </p>
                </div>
                <div class="okna-process-card">
                    <p class="okna-process-card__title">
                        Доставка и монтаж
                        <span>
                        <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M32.725 18.1672L29.4438 10.5109C29.36 10.3132 29.22 10.1446 29.041 10.0259C28.8621 9.90728 28.6522 9.84392 28.4375 9.84375H25.1562V7.65625C25.1562 7.36617 25.041 7.08797 24.8359 6.88285C24.6308 6.67773 24.3526 6.5625 24.0625 6.5625H3.28125C2.99117 6.5625 2.71297 6.67773 2.50785 6.88285C2.30273 7.08797 2.1875 7.36617 2.1875 7.65625V26.25C2.1875 26.5401 2.30273 26.8183 2.50785 27.0234C2.71297 27.2285 2.99117 27.3438 3.28125 27.3438H5.62187C5.87375 28.2706 6.4236 29.0887 7.18659 29.6721C7.94958 30.2554 8.88332 30.5714 9.84375 30.5714C10.8042 30.5714 11.7379 30.2554 12.5009 29.6721C13.2639 29.0887 13.8138 28.2706 14.0656 27.3438H20.9344C21.1862 28.2706 21.7361 29.0887 22.4991 29.6721C23.2621 30.2554 24.1958 30.5714 25.1562 30.5714C26.1167 30.5714 27.0504 30.2554 27.8134 29.6721C28.5764 29.0887 29.1263 28.2706 29.3781 27.3438H31.7188C32.0088 27.3438 32.287 27.2285 32.4921 27.0234C32.6973 26.8183 32.8125 26.5401 32.8125 26.25V18.5938C32.8122 18.4471 32.7825 18.3021 32.725 18.1672ZM25.1562 12.0312H27.7156L30.0562 17.5H25.1562V12.0312ZM9.84375 28.4375C9.4111 28.4375 8.98817 28.3092 8.62844 28.0688C8.26871 27.8285 7.98833 27.4868 7.82276 27.0871C7.6572 26.6874 7.61388 26.2476 7.69828 25.8232C7.78269 25.3989 7.99103 25.0091 8.29695 24.7032C8.60288 24.3973 8.99266 24.1889 9.41699 24.1045C9.84132 24.0201 10.2812 24.0634 10.6809 24.229C11.0806 24.3946 11.4222 24.675 11.6626 25.0347C11.903 25.3944 12.0312 25.8174 12.0312 26.25C12.0312 26.8302 11.8008 27.3866 11.3905 27.7968C10.9803 28.207 10.4239 28.4375 9.84375 28.4375ZM20.9344 25.1562H14.0656C13.8138 24.2294 13.2639 23.4113 12.5009 22.8279C11.7379 22.2446 10.8042 21.9286 9.84375 21.9286C8.88332 21.9286 7.94958 22.2446 7.18659 22.8279C6.4236 23.4113 5.87375 24.2294 5.62187 25.1562H4.375V8.75H22.9688V22.4875C22.4707 22.7766 22.0346 23.1611 21.6855 23.6191C21.3364 24.077 21.0812 24.5994 20.9344 25.1562ZM25.1562 28.4375C24.7236 28.4375 24.3007 28.3092 23.9409 28.0688C23.5812 27.8285 23.3008 27.4868 23.1353 27.0871C22.9697 26.6874 22.9264 26.2476 23.0108 25.8232C23.0952 25.3989 23.3035 25.0091 23.6095 24.7032C23.9154 24.3973 24.3052 24.1889 24.7295 24.1045C25.1538 24.0201 25.5937 24.0634 25.9934 24.229C26.3931 24.3946 26.7347 24.675 26.9751 25.0347C27.2155 25.3944 27.3438 25.8174 27.3438 26.25C27.3438 26.8302 27.1133 27.3866 26.703 27.7968C26.2928 28.207 25.7364 28.4375 25.1562 28.4375ZM30.625 25.1562H29.3781C29.1363 24.2195 28.5907 23.3893 27.8268 22.7956C27.0629 22.2019 26.1237 21.8781 25.1562 21.875V19.6875H30.625V25.1562Z"
                                  fill="white"/>
                        </svg>
                    </span>
                    </p>
                    <p class="okna-process-card__text okna-text">
                        Доставка конструкций и стеклоизделий на объект. Установка конструкций в проемы согласно рабочим
                        эскизам
                    </p>
                </div>
            </div>
            <div class="okna-process__center">
                <div class="okna-process__numbers">
                    <span>1</span>
                    <span>2</span>
                    <span>3</span>
                    <span>4</span>
                    <span>5</span>
                    <span>6</span>
                </div>
            </div>
            <div class="okna-process__right">
                <div class="okna-process-card">
                    <p class="okna-process-card__title">
                        <span>
                        <svg width="35" height="29" viewBox="0 0 35 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M31.6631 4.77271C32.5035 4.77271 33.2327 5.08343 33.8506 5.70488C34.4686 6.32633 34.7775 7.08449 34.7775 7.97938V20.6569C34.7775 21.5518 34.4686 22.31 33.8506 22.9314C33.2327 23.5529 32.5035 23.8636 31.6631 23.8636H3.18856C2.29873 23.8636 1.54484 23.5529 0.926907 22.9314C0.308969 22.31 0 21.5518 0 20.6569V7.97938C0 7.08449 0.308969 6.32633 0.926907 5.70488C1.54484 5.08343 2.29873 4.77271 3.18856 4.77271H31.6631ZM31.6631 20.6569V7.97938H28.4746V14.3182H25.286V7.97938H22.1716V14.3182H18.983V7.97938H15.7945V14.3182H12.6801V7.97938H9.49152V14.3182H6.30297V7.97938H3.18856V20.6569H31.6631Z"
                                  fill="white"/>
                        </svg>
                    </span>
                        Замеры
                    </p>
                    <p class="okna-process-card__text okna-text">
                        Произведем замер либо воспользуется предоставленными вами размерами
                    </p>
                </div>
                <div class="okna-process-card">
                    <p class="okna-process-card__title">
                        <span>
                        <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M8.75 16.9264V26.25H18.0736L16.1292 24.3056H10.6944V18.8708L8.75 16.9264Z"
                                  fill="white"/>
                            <path d="M33.9014 31.393L31.1111 28.5639V31.1111H3.88889V27.0764H5.83333V25.5208H3.88889V19.0555H5.83333V17.5H3.88889V11.2778H5.83333V9.72221H3.88889V4.28748L19.3861 19.6972V16.9555L3.60694 1.25415C3.47096 1.11704 3.29722 1.02353 3.10788 0.985546C2.91855 0.947562 2.72219 0.966823 2.54384 1.04087C2.36549 1.11493 2.21323 1.24041 2.10648 1.40133C1.99973 1.56225 1.94332 1.75132 1.94444 1.94443V32.0833C1.94444 32.3412 2.04687 32.5885 2.2292 32.7708C2.41153 32.9531 2.65882 33.0555 2.91667 33.0555H33.2111C33.4042 33.0567 33.5933 33.0003 33.7542 32.8935C33.9151 32.7868 34.0406 32.6345 34.1147 32.4561C34.1887 32.2778 34.208 32.0814 34.17 31.8921C34.132 31.7028 34.0385 31.529 33.9014 31.393V31.393Z"
                                  fill="white"/>
                            <path d="M23.3333 29.1667H27.2222C27.7379 29.1667 28.2325 28.9618 28.5971 28.5971C28.9618 28.2325 29.1667 27.7379 29.1667 27.2222V8.45832L26.9306 4.34582C26.7576 4.0462 26.5079 3.79815 26.2071 3.62725C25.9063 3.45635 25.5654 3.36879 25.2194 3.3736C24.8657 3.37641 24.5194 3.47567 24.2179 3.66069C23.9164 3.84571 23.671 4.10949 23.5083 4.4236L21.3889 8.47777V27.2222C21.3889 27.7379 21.5937 28.2325 21.9584 28.5971C22.3231 28.9618 22.8176 29.1667 23.3333 29.1667ZM23.3333 8.94443L25.2194 5.27916L27.2222 8.95416V23.3333H23.3333V8.94443ZM23.3333 24.918H27.2222V27.2903H23.3333V24.918Z"
                                  fill="white"/>
                        </svg>
                    </span>
                        Рабочие эскизы
                    </p>
                    <p class="okna-process-card__text okna-text">
                        Прорисовка внешних видов, узловые решения, описание комплектации
                    </p>
                </div>
                <div class="okna-process-card">
                    <p class="okna-process-card__title">
                        <span>
                        <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M28.9844 30.0781V3.28125H6.01562V30.0781H3.28125V32.2656H31.7188V30.0781H28.9844ZM8.20312 5.46875H16.4062V13.6719H8.20312V5.46875ZM8.20312 15.8594H16.4062V25.7031H8.20312V15.8594ZM26.7969 30.0781H8.20312V27.8906H26.7969V30.0781ZM26.7969 25.7031H18.5938V15.8594H26.7969V25.7031ZM26.7969 13.6719H18.5938V5.46875H26.7969V13.6719Z"
                                  fill="white"/>
                        </svg>
                    </span>
                        Изготовление
                    </p>
                    <p class="okna-process-card__text okna-text">
                        Изготовление конструкций и стеклоизделий
                    </p>
                </div>
            </div>
        </div>

    </div>
</section>

<?= get_advantages() ?>

<section class="okna-services">
    <div class="container">
        <h2 class="okna-header okna-services__header">
            Наши услуги
        </h2>

        <div class="card-service">
            <div class="row">
                <div class="col-lg-4 col-12">
                    <img class="card-service__img" src="/wp-content/themes/storefront-child/img/image-placeholder.jpg"
                         alt="">
                </div>
                <div class="col-lg-8 col-12">
                    <div class="card-service__body">
                        <p class="card-service__title bottom-line">
                            Услуга номер 1
                        </p>
                        <p class="card-service__info okna-text">
                            Описание услуги. Как проходит эта услуга, сроки оказания и прочее.Описание услуги. Как
                            проходит
                            эта услуга, сроки оказания и прочее.
                        </p>
                        <button class="btn btn-okna-primary inc-reaction" data-title="Оформите заявку на замеры"
                                data-toggle="modal"
                                data-target="#orderModal">
                            Оставить заявку
                        </button>
                    </div>
                </div>
            </div>
        </div>
        <div class="card-service">
            <div class="row">
                <div class="col-lg-4 col-12">
                    <img class="card-service__img" src="/wp-content/themes/storefront-child/img/image-placeholder.jpg"
                         alt="">
                </div>
                <div class="col-lg-8 col-12">
                    <div class="card-service__body">
                        <p class="card-service__title bottom-line">
                            Услуга номер 1
                        </p>
                        <p class="card-service__info okna-text">
                            Описание услуги. Как проходит эта услуга, сроки оказания и прочее.Описание услуги. Как
                            проходит
                            эта услуга, сроки оказания и прочее.
                        </p>
                        <button class="btn btn-okna-primary inc-reaction">
                            Оставить заявку
                        </button>
                    </div>
                </div>
            </div>
        </div>
        <div class="card-service">
            <div class="row">
                <div class="col-lg-4 col-12">
                    <img class="card-service__img" src="/wp-content/themes/storefront-child/img/image-placeholder.jpg"
                         alt="">
                </div>
                <div class="col-lg-8 col-12">
                    <div class="card-service__body">
                        <p class="card-service__title bottom-line">
                            Услуга номер 1
                        </p>
                        <p class="card-service__info okna-text">
                            Описание услуги. Как проходит эта услуга, сроки оказания и прочее.Описание услуги. Как
                            проходит
                            эта услуга, сроки оказания и прочее.
                        </p>
                        <button class="btn btn-okna-primary inc-reaction">
                            Оставить заявку
                        </button>
                    </div>
                </div>
            </div>
        </div>
    </div>
</section>

<?= get_projects(24) ?>

<?= get_colors(127) ?>

<?php get_footer(); ?>
